#+Title: Cosmoi Emacs
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+TODO: WIP | DONE

This is my Emacs init file, written in org-mode using literate
programming and =org-babel= blocks. The =init.el= file tangles the Elisp
code blocks of this file into =config.el=. I have taken ideas for my
configuration mainly from

  * [[http://cestlaz.github.io/][C'est la Z]]
  * [[https://github.com/hrs/dotfiles/blob/master/emacs.d/configuration.org][Harry R. Schwartz's configuration file]]

and from many other configuration files and blogs such as

  * [[http://emacsredux.com/][Emacs Redux]]
  * [[http://irreal.org/blog/][Irreal]]
  * [[https://oremacs.com][(or emacs irrelevant)]]
  * [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua's configuration file]]
  * [[http://karl-voit.at/2017/06/03/emacs-org/][Karl Voit's configuration file]]
  * [[http://spacemacs.org/][Spacemacs]]

It /works for me/ on Emacs 26.3 and org-version 9.3.6. You can check
your Emacs version with =M-x version= and your org-mode version with
=M-x org-version=.

** Agenda
#+BEGIN_SRC emacs-lisp
  ;; Agenda commands.  Builds the personal agenda.
  (setq org-agenda-custom-commands
        '(("c" "Complete agenda, todo and waiting tasks" (

            ;; High priority tasks
            (tags-todo "-habit-notask+TODO=\"TODO\"-WAITUNTIL>\"<today>\"+PRIORITY=\"A\"" (
               (org-agenda-overriding-header "Priority")
               ;(org-agenda-files '("~/org/agenda/Tasks.org"))
               ))

            ;; Agenda and calendar
            (agenda "" (
               (org-agenda-overriding-header "Agenda") 
               (org-agenda-skip-function '(org-agenda-skip-entry-if 'regexp ":habit:"))
               ;(org-agenda-files '("~/org/agenda/Tasks.org" "~/org/GCalendar.org"))
               ))

            ;; Habits
            ;; (tags-todo "+habit-SCHEDULED>\"<today>\"" (
            ;;    (org-agenda-overriding-header "Habits")
            ;;    (org-agenda-files '("~/org/agenda/Tasks.org"))
            ;;    ))

            ;; General to-do's
            (tags-todo "-habit-notask+TODO=\"TODO\"-SCHEDULED>\"<today>\"-WAITUNTIL>\"<today>\"-PRIORITY=\"A\"-PRIORITY=\"C\"" (
               (org-agenda-overriding-header "Tasks")
               ;(org-agenda-files '("~/org/agenda/Tasks.org"))
               ))

           ;; Non-priority tasks
            (tags-todo "-habit-notask+TODO=\"TODO\"-SCHEDULED>\"<today>\"-WAITUNTIL>\"<today>\"+PRIORITY=\"C\"" (
               (org-agenda-overriding-header "Non-priority")
               ;(org-agenda-files '("~/org/agenda/Tasks.org"))
               ))


            ;; Waiting tasks
            ;; (tags-todo "-habit-notask+TODO=\"WAIT\"-SCHEDULED>\"<today>\"" (
            ;;    (org-agenda-overriding-header "Waiting")
            ;;    (org-agenda-files '("~/org/agenda/Tasks.org"))
            ;;    ))
            ))))

  ;; Agenda filters.
  (setq org-agenda-tag-filter-preset '("-notask"))
  (setq org-agenda-files '("~/org/GCalendar.org" "~/org/agenda" "~/org/math/notes"))
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-todo-ignore-scheduled 'past)
  (setq org-agenda-show-future-repeats nil)
  (setq org-agenda-start-day "-1d")
  (setq org-agenda-span 7)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-start-on-weekday nil)

  ;; Blocked tasks become invisible.
  ;; https://orgmode.org/manual/TODO-dependencies.html#TODO-dependencies
  (setq org-agenda-dim-blocked-tasks 'invisible)

  ;; Extensible dependencies for the org-mode agenda.
  (use-package org-edna
    :ensure t
    :config
      (org-edna-load))

  ;; Show only today's habits.
  (setq org-habit-show-habits-only-for-today t)

  ;; Prefix format for the Emacs agenda.
  (setq org-agenda-prefix-format 
    '((agenda . " %i %-12:c%?-12t% s")
     (todo . " %i %-12:c")
     (tags . " %i %-12:c")
     (search . " %i %-12:c")))

  ;; This makes the q command bury the agenda buffer when you've finished
  ;; with it, rather than close it. The result of this is that the agenda
  ;; will reappear immediately when you next ask for it, but it won't have
  ;; been updated since you last saw it. If you want it updated you can
  ;; always press g in the agenda to rebuild it properly.
  ;; https://emacs.stackexchange.com/a/861/12208
  (setq org-agenda-sticky t)

  ;; The block separator in the agenda. It has to be declared as a number.
  ;; For instance, 32 is the whitespace.
  (setq org-agenda-block-separator 32)

  ;; I prefer the mini-calendar prompt to start on Monday.
  ;; https://emacs.stackexchange.com/questions/42571/org-agenda-date-prompt-mini-calendar-start-week-on-monday
  (setq calendar-week-start-day 1)

  ;; Pregenerates an agenda buffer whenever Emacs is idle for more than 5
  ;; seconds. The next time the agenda command is run, generation takes
  ;; less than a second, since the org buffers have already been loaded.
  ;; https://emacs.stackexchange.com/a/820/12208
  ;  
  ;; Currently disabled because it blocks Emacs too often.
  ; (run-with-idle-timer 5 nil (lambda () (org-agenda-list) (delete-window)))

  ;; Automatically rebuilds the agenda when idle.
  ;  Currently disabled because it blocks Emacs too often.
  ;; (defun renewOrgBuffer ()
  ;;   (interactive)
  ;;   (dolist (buffer (buffer-list))
  ;;     (with-current-buffer buffer
  ;;       (when (derived-mode-p 'org-agenda-mode)
  ;;     (org-agenda-maybe-redo))))
  ;;   )
  ;; (run-with-idle-timer 60 1000 #'renewOrgBuffer)
#+END_SRC

#+RESULTS:
: 1

** COMMENT Spacemacs dark theme
#+BEGIN_SRC emacs-lisp
  (message "[init] Spacemacs theme")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; Getting the Spacemacs look.
  ;; http://pragmaticemacs.com/emacs/get-that-spacemacs-look-without-spacemacs/
  (use-package spacemacs-theme
   :ensure t
   :no-require t
   :init
     (setq spacemacs-theme-org-agenda-height nil)
     (setq spacemacs-theme-org-height nil)
     (setq spacemacs-theme-comment-italic t)
     )

  ;; The function that loads the entire theme. It first loads spacemacs, then
  ;; applies the face preferences.
  (defun m42/reload-theme ()
    (interactive)
    (setq default "#cfcecd")
    (load-theme 'spacemacs-dark 1)
    
    ;; Colors
    (setq color/space-comment "#1e757f")
    (setq color/space-comment "#3E8991")
    (setq color/space-block "#827591")

    ;; More contrast for the default font.
    (set-face-attribute 'default nil :foreground "#cfcecd")

    ;; Comments and docs should share font
    (set-face-attribute 'font-lock-doc-face nil :foreground color/space-comment)
    (set-face-attribute 'font-lock-comment-face nil :foreground color/space-comment)
    
    ;; Standard org-mode faces.
    (set-face-attribute 'org-document-title nil :underline nil :height 1.0 :foreground "#4f97d7")
    (set-face-attribute 'org-document-info nil :underline nil :height 1.0 :foreground "#4f97d7")
    (set-face-attribute 'org-document-info-keyword nil :underline nil :height 1.0 :foreground color/space-block)
    (set-face-attribute 'org-special-keyword nil :foreground color/space-block) 
    (set-face-attribute 'org-meta-line nil :foreground color/space-block) 
    (set-face-attribute 'org-link nil :inherit 'link :weight 'normal :underline nil)
    (set-face-attribute 'org-todo nil :foreground "#ba6328")
    (set-face-attribute 'org-done nil :foreground "#5e9b20")
    (set-face-attribute 'org-date nil :foreground color/space-comment)
    (set-face-attribute 'org-priority nil :foreground "#ba6328" :weight 'normal)
    (set-face-attribute 'org-tag nil :foreground color/space-block)
    (set-face-attribute 'org-verbatim nil :foreground "#979797")
    (set-face-attribute 'org-table nil :background "#292b2e")
    (set-face-attribute 'org-block-begin-line nil :background "#292b2e")
    (set-face-attribute 'org-block-end-line nil :background "#292b2e")

    ;; Org agenda faces
    (set-face-attribute 'org-habit-ready-future-face nil :background "#5e9b20")
    (set-face-attribute 'org-habit-ready-face nil :background "#5e9b20")
    (set-face-attribute 'org-habit-overdue-future-face nil :background "#ba6328")
    (set-face-attribute 'org-habit-overdue-face nil :background "#ba6328")
    (set-face-attribute 'org-agenda-date-today nil :foreground "#7590db")
    (set-face-attribute 'org-agenda-date-today nil :inherit 'org-agenda-date :weight 'ultrabold :slant 'normal :underline nil)
    (set-face-attribute 'org-agenda-date-weekend nil :weight 'normal)
    (set-face-attribute 'org-scheduled nil :foreground "#2d9574")
    (set-face-attribute 'org-agenda-calendar-event nil :foreground "#2d9574")
  
    ;; Org mode levels.
    (set-face-attribute 'org-level-1 nil :weight 'normal :foreground "#4f97d7"); :foreground "#d08770"
    (set-face-attribute 'org-level-2 nil :weight 'normal :foreground "#5e81ac")
    (set-face-attribute 'org-level-3 nil :weight 'normal :foreground "#81a1c1"); :foreground "#a3be8c"
    (set-face-attribute 'org-level-4 nil :weight 'normal :foreground "#88c0d0")
    (set-face-attribute 'org-level-5 nil :weight 'normal :foreground "#8fbcbb")
    (set-face-attribute 'org-level-6 nil :weight 'normal :foreground "#b48ead")
    (set-face-attribute 'org-level-7 nil :weight 'normal :foreground "#a3be8c")
    (set-face-attribute 'org-level-8 nil :weight 'normal :foreground "#b3be8c")

    ;; Neotree arrow
    (set-face-attribute 'neo-expand-btn-face nil :foreground "#5e81ac")
  )

  ;; I have a problem with this theme: =unspecified-background= is an error I
  ;; get if I try to use it with emacs --daemon. That is why it is necessary to
  ;; wait until the frame is created to reload the complete theme.
  (if (daemonp)
      (add-hook 'after-make-frame-functions (lambda (frame)
          (when (eq (length (frame-list)) 2)
              (progn
                (select-frame frame)
                (m42/reload-theme)))))
    (m42/reload-theme))
#+END_SRC

#+RESULTS:
| (lambda (frame) (when (eq (length (frame-list)) 2) (progn (select-frame frame) (m42/reload-theme)))) | x-dnd-init-frame |

** COMMENT Spacemacs light theme
#+BEGIN_SRC emacs-lisp
  (message "[init] Spacemacs theme")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; Getting the Spacemacs look.
  ;; http://pragmaticemacs.com/emacs/get-that-spacemacs-look-without-spacemacs/
  (use-package spacemacs-theme
   :ensure t
   :no-require t
   :init
     (setq spacemacs-theme-org-agenda-height nil)
     (setq spacemacs-theme-org-height nil)
     (setq spacemacs-theme-comment-italic t)
     )

  ;; The function that loads the entire theme. It first loads spacemacs, then
  ;; applies the face preferences.
  (defun m42/reload-theme ()
    (interactive)
    (setq default "#cfcecd")
    (load-theme 'spacemacs-dark 1)
    
    ;; Colors
    (setq color/space-comment "#1e757f")
    (setq color/space-comment "#3E8991")
    (setq color/space-block "#827591")

    ;; More contrast for the default font.
    (set-face-attribute 'default nil :foreground "#cfcecd")

    ;; Comments and docs should share font
    (set-face-attribute 'font-lock-doc-face nil :foreground color/space-comment)
    (set-face-attribute 'font-lock-comment-face nil :foreground color/space-comment)
    
    ;; Standard org-mode faces.
    (set-face-attribute 'org-document-title nil :underline nil :height 1.0 :foreground "#4f97d7")
    (set-face-attribute 'org-document-info nil :underline nil :height 1.0 :foreground "#4f97d7")
    (set-face-attribute 'org-document-info-keyword nil :underline nil :height 1.0 :foreground color/space-block)
    (set-face-attribute 'org-special-keyword nil :foreground color/space-block) 
    (set-face-attribute 'org-meta-line nil :foreground color/space-block) 
    (set-face-attribute 'org-link nil :inherit 'link :weight 'normal :underline nil)
    (set-face-attribute 'org-todo nil :foreground "#ba6328")
    (set-face-attribute 'org-done nil :foreground "#5e9b20")
    (set-face-attribute 'org-date nil :foreground color/space-comment)
    (set-face-attribute 'org-priority nil :foreground "#ba6328" :weight 'normal)
    (set-face-attribute 'org-tag nil :foreground color/space-block)
    (set-face-attribute 'org-verbatim nil :foreground "#979797")
    (set-face-attribute 'org-table nil :background "#292b2e")
    (set-face-attribute 'org-block-begin-line nil :background "#292b2e")
    (set-face-attribute 'org-block-end-line nil :background "#292b2e")

    ;; Org agenda faces
    (set-face-attribute 'org-habit-ready-future-face nil :background "#5e9b20")
    (set-face-attribute 'org-habit-ready-face nil :background "#5e9b20")
    (set-face-attribute 'org-habit-overdue-future-face nil :background "#ba6328")
    (set-face-attribute 'org-habit-overdue-face nil :background "#ba6328")
    (set-face-attribute 'org-agenda-date-today nil :foreground "#7590db")
    (set-face-attribute 'org-agenda-date-today nil :inherit 'org-agenda-date :weight 'ultrabold :slant 'normal :underline nil)
    (set-face-attribute 'org-agenda-date-weekend nil :weight 'normal)
    (set-face-attribute 'org-scheduled nil :foreground "#2d9574")
    (set-face-attribute 'org-agenda-calendar-event nil :foreground "#2d9574")
  
    ;; Org mode levels.
    (set-face-attribute 'org-level-1 nil :weight 'normal :foreground "#4f97d7"); :foreground "#d08770"
    (set-face-attribute 'org-level-2 nil :weight 'normal :foreground "#5e81ac")
    (set-face-attribute 'org-level-3 nil :weight 'normal :foreground "#81a1c1"); :foreground "#a3be8c"
    (set-face-attribute 'org-level-4 nil :weight 'normal :foreground "#88c0d0")
    (set-face-attribute 'org-level-5 nil :weight 'normal :foreground "#8fbcbb")
    (set-face-attribute 'org-level-6 nil :weight 'normal :foreground "#b48ead")
    (set-face-attribute 'org-level-7 nil :weight 'normal :foreground "#a3be8c")
    (set-face-attribute 'org-level-8 nil :weight 'normal :foreground "#b3be8c")

    ;; Neotree arrow
    (set-face-attribute 'neo-expand-btn-face nil :foreground "#5e81ac")
  )

  ;; I have a problem with this theme: =unspecified-background= is an error I
  ;; get if I try to use it with emacs --daemon. That is why it is necessary to
  ;; wait until the frame is created to reload the complete theme.
  (if (daemonp)
      (add-hook 'after-make-frame-functions (lambda (frame)
          (when (eq (length (frame-list)) 2)
              (progn
                (select-frame frame)
                (m42/reload-theme)))))
    (m42/reload-theme))
#+END_SRC

#+RESULTS:
| (lambda (frame) (when (eq (length (frame-list)) 2) (progn (select-frame frame) (m42/reload-theme)))) | (lambda (frame) (if (eq (length (frame-list)) 2) (progn (progn (select-frame frame) (m42/reload-theme))))) | x-dnd-init-frame |

